wisteria-1c/Конфигурация/Enums/ВидыПодписиМПЭПД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыПодписиМПЭПД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПростаяПодпись</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УНЭПГосключ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УКЭПГосключ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УКЭПРутокен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервисDSS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеИспользуется</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/ВидыПодписиМПЭПД/Forms/ФормаВыбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИндексПеречисления = ПолучитьИндексПоВидуПодписи(Параметры.ВидПодписи);
	Если ИндексПеречисления = 0 Тогда
		ИндексПеречисления = 1;
	КонецЕсли;
	
	ИспользуетсяИнтерфейс85 = КлиентскоеПриложение.ТекущийВариантИнтерфейса()
		= ВариантИнтерфейсаКлиентскогоПриложения.Версия8_5;
	
	Если ИспользуетсяИнтерфейс85 Тогда
		Элементы.ОК.Заголовок = "Записать и закрыть";
		Команды.ОК.Подсказка = "Записать и закрыть";
		Элементы.Отмена.Видимость = Ложь;
		
		Элементы.ДекорацияОписаниеДляПЭП.ЦветТекста = Новый Цвет;
		Элементы.ДекорацияОписаниеДляУНЭПГосключ.ЦветТекста = Новый Цвет;
		Элементы.ДекорацияОписаниеДляУКЭПРутокен.ЦветТекста = Новый Цвет;
	Иначе 	
		Элементы.ИндексПеречисления.Подсказка = "";
		Элементы.ИндексПеречисления1.Подсказка = "";
		Элементы.ИндексПеречисления4.Подсказка = "";
		
		Элементы.ИндексПеречисления.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
		Элементы.ИндексПеречисления1.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
		Элементы.ИндексПеречисления4.ОтображениеПодсказки = ОтображениеПодсказки.Нет;

	КонецЕсли;
	
	Элементы.ДекорацияОписаниеДляПЭП.Видимость = Не ИспользуетсяИнтерфейс85;
	Элементы.ДекорацияОписаниеДляУНЭПГосключ.Видимость = Не ИспользуетсяИнтерфейс85;
	Элементы.ДекорацияОписаниеДляУКЭПРутокен.Видимость = Не ИспользуетсяИнтерфейс85;
	
	Элементы.ДекорацияОтступ1.Видимость = Не ИспользуетсяИнтерфейс85;
	Элементы.ДекорацияОтступ2.Видимость = Не ИспользуетсяИнтерфейс85;
	Элементы.ДекорацияОтступ.Видимость = Не ИспользуетсяИнтерфейс85;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
    ВидПодписи = ПолучитьВидПодписиПоИндексу(ИндексПеречисления);
	ОповеститьОВыборе(ВидПодписи);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьВидПодписиПоИндексу(Индекс)

	Если Индекс = 1 Тогда
		ВидПодписи = ПредопределенноеЗначение("Перечисление.ВидыПодписиМПЭПД.ПростаяПодпись");
		
	ИначеЕсли Индекс = 2 Тогда
		ВидПодписи = ПредопределенноеЗначение("Перечисление.ВидыПодписиМПЭПД.УНЭПГосключ");
		
	ИначеЕсли Индекс = 3 Тогда
		ВидПодписи = ПредопределенноеЗначение("Перечисление.ВидыПодписиМПЭПД.УКЭПГосключ");
		
	ИначеЕсли Индекс = 4 Тогда
		ВидПодписи = ПредопределенноеЗначение("Перечисление.ВидыПодписиМПЭПД.УКЭПРутокен");
		
	КонецЕсли;

	Возврат ВидПодписи;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьИндексПоВидуПодписи(ВидПодписи)

	Индекс = 0;
	
	Если ВидПодписи = ПредопределенноеЗначение("Перечисление.ВидыПодписиМПЭПД.ПростаяПодпись") Тогда
		Индекс = 1;
		
	ИначеЕсли ВидПодписи = ПредопределенноеЗначение("Перечисление.ВидыПодписиМПЭПД.УНЭПГосключ") Тогда
		Индекс = 2;
		
	ИначеЕсли ВидПодписи = ПредопределенноеЗначение("Перечисление.ВидыПодписиМПЭПД.УКЭПГосключ") Тогда
		Индекс = 3;
		
	ИначеЕсли ВидПодписи = ПредопределенноеЗначение("Перечисление.ВидыПодписиМПЭПД.УКЭПРутокен") Тогда
		Индекс = 4;
		
	КонецЕсли;

	Возврат Индекс;
	
КонецФункции

#КонецОбласти
